api/app/controllers/flights_controller.rb

  def index
    flights = Flight.all.map do |flight|
---
SELECT "flights".* FROM "flights"

  def show
    @flight = Flight.find(params[:id])
---
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]