api/app/controllers/reviews_controller.rb

SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("flight_id", "user_id", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["flight_id", 2], ["user_id", 1], ["rating", 3], ["comment", "Itwasalright.Could be better"], ["created_at", "2023-04-01 16:26:24.645243"], ["updated_at", "2023-04-01 16:26:24.645243"]]
---
    def create
      @flight = Flight.find_by(id: params[:flight_id])
      @review = @flight.reviews.new(review_params)
      # @review.user = current_user

      if @review.save

SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "flights".* FROM "flights" WHERE "flights"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."flight_id" = ?  [["flight_id", 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 2]]
---
    def index
      @flight = Flight.find(params[:flight_id])
      @reviews = @flight.reviews.includes(:user)