api/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ?  [["user_id", 2]]
---
    def bookings
        @user = User.find(params[:user_id])
        @bookings = @user.bookings.includes(flight: [:origin, :destination])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        user = User.find(session[:user_id])

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "malcolm"], ["email", "malcolm@mail"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-01 17:04:35.713745"], ["updated_at", "2023-04-01 17:04:35.713745"]]
---
    def create
        user = User.create(user_params)