api/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "malcolm"], ["email", "malcolm@mail"], ["password_digest", "[FILTERED]"], ["created_at", "2023-04-01 17:04:35.713745"], ["updated_at", "2023-04-01 17:04:35.713745"]]
---
    def create
        @user = User.create(create_param)
            if @user.save